#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_mytestprojectname-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7a23036b-733f-4899-b840-8e04ce9ad7b1]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=59f71ef0-fe8e-4c8b-8b0d-4b03761fe41b]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=e2491a64-839d-4913-96ae-42a4accf758e]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=96324cf6-85e9-409d-8d2b-deb15aafa560]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8676d291-c808-4cbd-81fc-723d25113184]
module.keycloak_test.module.onestopauth.module.client_jon-test-7-107.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7a8d09a5-4044-4b8e-983c-48a5cf3e11b7]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d80c8eea-41df-4b00-b858-cb5285589e2e]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=3bc157b4-fe70-4a1f-953d-198c3ec60e10]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ae05777c-b6c1-4a77-9577-c75d132d72d5]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=11d2d86e-8fb4-4ebf-979d-d8aa0f3cc223]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e1a776cc-65b7-4f58-b3de-9c00d3ef89c5]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=08cc3bef-7a0c-45d4-95a0-02c3de1726af]
module.keycloak_test.module.onestopauth.module.client_test-6-08-10-2021-471.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbbd7544-ecd0-4741-9bd6-55a9682f3301]
module.keycloak_test.module.onestopauth.module.client_test-project-1-663.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f9b7aa3e-ffea-441a-8b64-81d594306636]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ea55037b-e1ef-488a-a9bb-369203ac1e54]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a4038a18-7e89-4d5e-969f-c5d160540867]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95a80664-1e47-4a39-b50e-80213d5a4ec7]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65ebcb36-21f5-4b3f-87ce-1f8c3041d1d1]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=73c0c364-21b0-4b46-a6d4-c3c890a1481d]
module.keycloak_test.module.onestopauth.module.client_test-07-28-2021-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=d9e4c5ec-c3a3-4a06-82d7-e8e68d1e8236]
module.keycloak_test.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e8926c2e-0b3a-4f70-b16b-0adef320d6dd]
module.keycloak_test.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=71884a9f-9983-41fe-9ff9-e6f338646f46]
module.keycloak_test.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=61332401-a9aa-4778-a53c-22986345cd49]
module.keycloak_test.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4ad767cb-c7e0-498b-b78e-953b766b506c]
module.keycloak_test.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1dbf16b3-6e36-47ac-8b83-7a2401f5896b]
module.keycloak_test.module.onestopauth.module.client_august-17th-4-pm-599.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3c08b706-e187-43b4-96d2-6b5459f3241e]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1c957d58-1be0-4bc8-8587-29f27cd85bc8]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7ba0e21e-fdb7-457c-aad0-f2adf19bbcce]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=19631743-2703-4271-8310-27782c832850]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8c19e771-4979-42a1-a9b1-bc76281244bb]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf7bdbd6-4d80-448e-964f-8130cdfd46d5]
module.keycloak_test.module.onestopauth.module.client_test-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e6476adb-2ffb-471c-a9c0-d7f6361e8507]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c4207cb-0a3d-4020-a651-e133874981ab]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1afa4a96-3b43-42c3-9df5-c574d6cfc21f]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4e884a7c-bf32-4700-aa5a-92f89bab869e]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=2e3114c5-bc10-4469-ad05-2fa1834de165]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e8521809-80cd-495c-86ea-1903728f602a]
module.keycloak_prod.module.onestopauth.module.client_negajjangproject-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9051c3a7-50fa-4803-8901-861309971cee]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "sasa-1553"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_sasa-1553.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "sasa-1553"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sasa-1553"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://a",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "sasa-1553"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "sasa-1553"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sasa-1553"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://c",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_asdfsafa-1322.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "34ebfcc9-1348-484f-a918-198336d20505"
        name                                     = "asdfsafa-1322"
      ~ valid_redirect_uris                      = [
          - "http://www.google.ca",
          + "http://www.google.ca12133",
        ]
        # (13 unchanged attributes hidden)
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "sasa-1553"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "sasa-1553"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "sasa-1553"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://b",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

Plan: 21 to add, 1 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2009 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*